app/controllers/cart_items_controller.rb

SELECT "cart_items".* FROM "cart_items"
---
  def index
    @cart_items = Cartitem.all

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" ORDER BY "cart_items"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def show
    item = Item.find(params[:id])
    @cart_item = Cartitem.all

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "cartitems" ("item_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["item_id", 1], ["created_at", "2018-11-28 12:18:47.719701"], ["updated_at", "2018-11-28 12:18:47.719701"]]
---
  def create
    item = Item.find(params[:item_id])
    @cart_item = @cart.cartitems.new(item: item)

    respond_to do |format|
      if @cart_item.save

DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 4]]
---
  def destroy
    @cart_item.destroy

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_cart_item
      @cart_item = Cartitem.find(params[:id])