app/controllers/concerns/current_cart.rb

    def set_cart

        @cart = Cart.find_by(id: session[cart_id]) || Cart.create
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" IS NULL LIMIT $1  [["LIMIT", 1]]